
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");	
	//Подсказка = "Введите название товара";
	
	//ВвестиСтроку(НазваниеТовара, Подсказка);
	Если ПроверитьНазваниеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе			
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

// Проверить название товара.
// 
// Параметры:
//  НазваниеТовара - Строка - Название товара
// 
// Возвращаемое значение:
//  Булево - Проверить название товара
&НаСервере
Функция ПроверитьНазваниеТовара(НазваниеТовара)
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Мандарины";
	СтрокаТовара.Цена = 100;
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Абрикосы";
	СтрокаТовара.Цена = 50;
	
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеТовара(НазваниеТовара);
	Возврат ТоварСуществует
	//Возврат Не Справочники.Товары.НайтиПоНаименованию(НазваниеТовара, Истина).Пустая();
КонецФункции